# list
grades = ['A', 'A', 'B', 'C', 'D']

'''
grades 리스트는 다섯 명의 학생 성적에 대해 다섯 개의 변수 grades0, grades1, grades2, grades3, grades4를 사용한 것과 같다.
리스트의 이점은 위와 같이 여러 개의 변수를 사용할 필요 없이 하나의 공통된 이름을 통해 여러 개의 값을 저장할 수 있다는 점이다. 
'''

# 30.2-1 리스트 설계하기
# 14명의 나이를 저장할 수 있는 리스트를 설계하고 이 리스트의 모든 요소에 값을 할당하여라. 

ages_14 = [17, 25, 45, 2, 5, 60, 33, 23, 21, 23, 22, 20, 18, 49]


# 30.2-2 리스트 설계하기
# 일곱 명의 이름과 나이를 저장할 수 있는 리스트를 설계하고, 이 리스트의 모든 요소에 값을 할당하여라.

names_7 = ['Harry', 'Ron', 'Hanna', 'Mia', 'Dia', 'Noah', 'Hane']
ages_7 = [30, 22, 32, 15, 45, 30, 29]
names_ages_7 = [names_7, ages_7]
print(names_ages_7)

